/******************************************************************************

       记录专用底层驱动程序-在单Flash个Sector中的实现-回调或辅助函数接口

******************************************************************************/
#ifndef __REC_DEV_FLASH_S_H
#define __REC_DEV_FLASH_S_H


/******************************************************************************
                                  辅助函数
******************************************************************************/



/******************************************************************************
                                   回调函数
******************************************************************************/

//---------------由设备将记录区移至缓冲区中，并返回基址与缓冲长度--------------------
//此函数在擦除前调用，由回调函数提取出有用的记录(一般为最后的最新记录，如屏蔽记录
//等，要求被屏蔽的设备必须要有记录，故其再老，也得需单独提取出来)
const unsigned char *RecDev_pcbRecToBuf(const struct _RecDev *pDev,
                                          unsigned short *pBufSize);


#endif //__REC_DEV_FLASH_S_H
